In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.Series([1, 2, 3, 4, np.nan, 5]) # from list

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
dtype: float64

In [3]:
pd.Series([1, 2, 3, 4, np.nan, 5]) # from list

0    1.0
1    2.0
2    3.0
3    4.0
4    NaN
5    5.0
dtype: float64

In [4]:
pd.Series({"a":1, "b": 2}) # from dictionary

a    1
b    2
dtype: int64

In [5]:
pd.Series(np.array([1, 2, 3])) # from nd.array

0    1
1    2
2    3
dtype: int32

In [7]:
pd.DataFrame(np.random.randn(7, 4), index=[2, 3, 4, 5, 6, 7, 8], columns=[list("ABCD")]) # from random nd array

          A         B         C         D
2 -1.079641 -1.027859  0.772363  0.060505
3 -1.257382 -0.000867  1.999656  0.539588
4 -1.297795 -0.459049  1.244240  0.326411
5  0.996527 -2.862265  1.647518 -1.869757
6 -1.286063  1.398045 -0.185069  0.764125
7  0.552353  0.933833 -1.108888  0.419149
8  2.750787  1.087442  0.523593  0.747111

In [14]:
pd.DataFrame({
    "Name":"Student", 
    "School": "SiTE", 
    "Date": pd.Timestamp("20220102"), 
    "Year": 4, 
    "Dep't": "Software Engineering",
    "Stream":  pd.Categorical(["AI", "SE", "Cyber", "IT"])
})

      Name School       Date  Year                 Dep't Stream
0  Student   SiTE 2022-01-02     4  Software Engineering     AI
1  Student   SiTE 2022-01-02     4  Software Engineering     SE
2  Student   SiTE 2022-01-02     4  Software Engineering  Cyber
3  Student   SiTE 2022-01-02     4  Software Engineering     IT

In [20]:
data = np.arange(800).reshape((80, 10))
df = pd.DataFrame(data)

In [21]:
# Using head to display the first 5 data
df.head(5)

    0   1   2   3   4   5   6   7   8   9
0   0   1   2   3   4   5   6   7   8   9
1  10  11  12  13  14  15  16  17  18  19
2  20  21  22  23  24  25  26  27  28  29
3  30  31  32  33  34  35  36  37  38  39
4  40  41  42  43  44  45  46  47  48  49

In [22]:
# Using tail to display the first 5 data
df.tail(5)

      0    1    2    3    4    5    6    7    8    9
75  750  751  752  753  754  755  756  757  758  759
76  760  761  762  763  764  765  766  767  768  769
77  770  771  772  773  774  775  776  777  778  779
78  780  781  782  783  784  785  786  787  788  789
79  790  791  792  793  794  795  796  797  798  799

In [24]:
df.index  # indexing

RangeIndex(start=0, stop=80, step=1)

In [25]:
df.columns # columns

RangeIndex(start=0, stop=10, step=1)

In [28]:
df.values

array([[  0,   1,   2,   3,   4,   5,   6,   7,   8,   9],
       [ 10,  11,  12,  13,  14,  15,  16,  17,  18,  19],
       [ 20,  21,  22,  23,  24,  25,  26,  27,  28,  29],
       [ 30,  31,  32,  33,  34,  35,  36,  37,  38,  39],
       [ 40,  41,  42,  43,  44,  45,  46,  47,  48,  49],
       [ 50,  51,  52,  53,  54,  55,  56,  57,  58,  59],
       [ 60,  61,  62,  63,  64,  65,  66,  67,  68,  69],
       [ 70,  71,  72,  73,  74,  75,  76,  77,  78,  79],
       [ 80,  81,  82,  83,  84,  85,  86,  87,  88,  89],
       [ 90,  91,  92,  93,  94,  95,  96,  97,  98,  99],
       [100, 101, 102, 103, 104, 105, 106, 107, 108, 109],
       [110, 111, 112, 113, 114, 115, 116, 117, 118, 119],
       [120, 121, 122, 123, 124, 125, 126, 127, 128, 129],
       [130, 131, 132, 133, 134, 135, 136, 137, 138, 139],
       [140, 141, 142, 143, 144, 145, 146, 147, 148, 149],
       [150, 151, 152, 153, 154, 155, 156, 157, 158, 159],
       [160, 161, 162, 163, 164, 165, 166, 167, 168, 169],
       [170, 171, 172, 173, 174, 175, 176, 177, 178, 179],
       [180, 181, 182, 183, 184, 185, 186, 187, 188, 189],
       [190, 191, 192, 193, 194, 195, 196, 197, 198, 199],
       [200, 201, 202, 203, 204, 205, 206, 207, 208, 209],
       [210, 211, 212, 213, 214, 215, 216, 217, 218, 219],
       [220, 221, 222, 223, 224, 225, 226, 227, 228, 229],
       [230, 231, 232, 233, 234, 235, 236, 237, 238, 239],
       [240, 241, 242, 243, 244, 245, 246, 247, 248, 249],
       [250, 251, 252, 253, 254, 255, 256, 257, 258, 259],
       [260, 261, 262, 263, 264, 265, 266, 267, 268, 269],
       [270, 271, 272, 273, 274, 275, 276, 277, 278, 279],
       [280, 281, 282, 283, 284, 285, 286, 287, 288, 289],
       [290, 291, 292, 293, 294, 295, 296, 297, 298, 299],
       [300, 301, 302, 303, 304, 305, 306, 307, 308, 309],
       [310, 311, 312, 313, 314, 315, 316, 317, 318, 319],
       [320, 321, 322, 323, 324, 325, 326, 327, 328, 329],
       [330, 331, 332, 333, 334, 335, 336, 337, 338, 339],
       [340, 341, 342, 343, 344, 345, 346, 347, 348, 349],
       [350, 351, 352, 353, 354, 355, 356, 357, 358, 359],
       [360, 361, 362, 363, 364, 365, 366, 367, 368, 369],
       [370, 371, 372, 373, 374, 375, 376, 377, 378, 379],
       [380, 381, 382, 383, 384, 385, 386, 387, 388, 389],
       [390, 391, 392, 393, 394, 395, 396, 397, 398, 399],
       [400, 401, 402, 403, 404, 405, 406, 407, 408, 409],
       [410, 411, 412, 413, 414, 415, 416, 417, 418, 419],
       [420, 421, 422, 423, 424, 425, 426, 427, 428, 429],
       [430, 431, 432, 433, 434, 435, 436, 437, 438, 439],
       [440, 441, 442, 443, 444, 445, 446, 447, 448, 449],
       [450, 451, 452, 453, 454, 455, 456, 457, 458, 459],
       [460, 461, 462, 463, 464, 465, 466, 467, 468, 469],
       [470, 471, 472, 473, 474, 475, 476, 477, 478, 479],
       [480, 481, 482, 483, 484, 485, 486, 487, 488, 489],
       [490, 491, 492, 493, 494, 495, 496, 497, 498, 499],
       [500, 501, 502, 503, 504, 505, 506, 507, 508, 509],
       [510, 511, 512, 513, 514, 515, 516, 517, 518, 519],
       [520, 521, 522, 523, 524, 525, 526, 527, 528, 529],
       [530, 531, 532, 533, 534, 535, 536, 537, 538, 539],
       [540, 541, 542, 543, 544, 545, 546, 547, 548, 549],
       [550, 551, 552, 553, 554, 555, 556, 557, 558, 559],
       [560, 561, 562, 563, 564, 565, 566, 567, 568, 569],
       [570, 571, 572, 573, 574, 575, 576, 577, 578, 579],
       [580, 581, 582, 583, 584, 585, 586, 587, 588, 589],
       [590, 591, 592, 593, 594, 595, 596, 597, 598, 599],
       [600, 601, 602, 603, 604, 605, 606, 607, 608, 609],
       [610, 611, 612, 613, 614, 615, 616, 617, 618, 619],
       [620, 621, 622, 623, 624, 625, 626, 627, 628, 629],
       [630, 631, 632, 633, 634, 635, 636, 637, 638, 639],
       [640, 641, 642, 643, 644, 645, 646, 647, 648, 649],
       [650, 651, 652, 653, 654, 655, 656, 657, 658, 659],
       [660, 661, 662, 663, 664, 665, 666, 667, 668, 669],
       [670, 671, 672, 673, 674, 675, 676, 677, 678, 679],
       [680, 681, 682, 683, 684, 685, 686, 687, 688, 689],
       [690, 691, 692, 693, 694, 695, 696, 697, 698, 699],
       [700, 701, 702, 703, 704, 705, 706, 707, 708, 709],
       [710, 711, 712, 713, 714, 715, 716, 717, 718, 719],
       [720, 721, 722, 723, 724, 725, 726, 727, 728, 729],
       [730, 731, 732, 733, 734, 735, 736, 737, 738, 739],
       [740, 741, 742, 743, 744, 745, 746, 747, 748, 749],
       [750, 751, 752, 753, 754, 755, 756, 757, 758, 759],
       [760, 761, 762, 763, 764, 765, 766, 767, 768, 769],
       [770, 771, 772, 773, 774, 775, 776, 777, 778, 779],
       [780, 781, 782, 783, 784, 785, 786, 787, 788, 789],
       [790, 791, 792, 793, 794, 795, 796, 797, 798, 799]])

In [31]:
pd.DataFrame([[1, 2, 3], [4, 5, 6]], columns=["A", "B", "C"], index=["a", "b"])

   A  B  C
a  1  2  3
b  4  5  6

In [35]:
# Descriptive Statistics
df = pd.DataFrame([[1, np.nan, 3], [4, 5, 6]], columns=["A", "B", "C"], index=["a", "b"])
print(df.count())
print(df.mean())
print(df.std())
print(df.sum())

A    2
B    1
C    2
dtype: int64
A    2.5
B    5.0
C    4.5
dtype: float64
A    2.12132
B        NaN
C    2.12132
dtype: float64
A    5.0
B    5.0
C    9.0
dtype: float64

In [36]:
print(df.describe())

             A    B        C
count  2.00000  1.0  2.00000
mean   2.50000  5.0  4.50000
std    2.12132  NaN  2.12132
min    1.00000  5.0  3.00000
25%    1.75000  5.0  3.75000
50%    2.50000  5.0  4.50000
75%    3.25000  5.0  5.25000
max    4.00000  5.0  6.00000

In [40]:
df.drop(["A"], axis=1)

     B  C
a  NaN  3
b  5.0  6